from common import input_value

task = '''
Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их
деление. Числа запрашивать у пользователя, предусмотреть обработку ситуации деления
на ноль.
'''

if __name__ == '__main__':
    print(task)