from common import input_value

task = '''
Реализовать функцию my_func(), которая принимает три позиционных аргумента,
и возвращает сумму наибольших двух аргументов.
'''

if __name__ == '__main__':
    print(task)